GopalSaraf/Practicals/PSDL/include/proc/pic16f1526.inc
// Register: PORTD
#define PORTD PORTD
PORTD                                    equ 000Fh
// bitfield definitions
PORTD_RD0_POSN                           equ 0000h
PORTD_RD0_POSITION                       equ 0000h
PORTD_RD0_SIZE                           equ 0001h
PORTD_RD0_LENGTH                         equ 0001h
PORTD_RD0_MASK                           equ 0001h
PORTD_RD1_POSN                           equ 0001h
PORTD_RD1_POSITION                       equ 0001h
PORTD_RD1_SIZE                           equ 0001h
PORTD_RD1_LENGTH                         equ 0001h
PORTD_RD1_MASK                           equ 0002h
PORTD_RD2_POSN                           equ 0002h
PORTD_RD2_POSITION                       equ 0002h
PORTD_RD2_SIZE                           equ 0001h
PORTD_RD2_LENGTH                         equ 0001h
PORTD_RD2_MASK                           equ 0004h
PORTD_RD3_POSN                           equ 0003h
PORTD_RD3_POSITION                       equ 0003h
PORTD_RD3_SIZE                           equ 0001h
PORTD_RD3_LENGTH                         equ 0001h
PORTD_RD3_MASK                           equ 0008h
PORTD_RD4_POSN                           equ 0004h
PORTD_RD4_POSITION                       equ 0004h
PORTD_RD4_SIZE                           equ 0001h
PORTD_RD4_LENGTH                         equ 0001h
PORTD_RD4_MASK                           equ 0010h
PORTD_RD5_POSN                           equ 0005h
PORTD_RD5_POSITION                       equ 0005h
PORTD_RD5_SIZE                           equ 0001h
PORTD_RD5_LENGTH                         equ 0001h
PORTD_RD5_MASK                           equ 0020h
PORTD_RD6_POSN                           equ 0006h
PORTD_RD6_POSITION                       equ 0006h
PORTD_RD6_SIZE                           equ 0001h
PORTD_RD6_LENGTH                         equ 0001h
PORTD_RD6_MASK                           equ 0040h
PORTD_RD7_POSN                           equ 0007h
PORTD_RD7_POSITION                       equ 0007h
PORTD_RD7_SIZE                           equ 0001h
PORTD_RD7_LENGTH                         equ 0001h
PORTD_RD7_MASK                           equ 0080h

// Register: PORTE
#define PORTE PORTE
PORTE                                    equ 0010h
// bitfield definitions
PORTE_RE0_POSN                           equ 0000h
PORTE_RE0_POSITION                       equ 0000h
PORTE_RE0_SIZE                           equ 0001h
PORTE_RE0_LENGTH                         equ 0001h
PORTE_RE0_MASK                           equ 0001h
PORTE_RE1_POSN                           equ 0001h
PORTE_RE1_POSITION                       equ 0001h
PORTE_RE1_SIZE                           equ 0001h
PORTE_RE1_LENGTH                         equ 0001h
PORTE_RE1_MASK                           equ 0002h
PORTE_RE2_POSN                           equ 0002h
PORTE_RE2_POSITION                       equ 0002h
PORTE_RE2_SIZE                           equ 0001h
PORTE_RE2_LENGTH                         equ 0001h
PORTE_RE2_MASK                           equ 0004h
PORTE_RE3_POSN                           equ 0003h
PORTE_RE3_POSITION                       equ 0003h
PORTE_RE3_SIZE                           equ 0001h
PORTE_RE3_LENGTH                         equ 0001h
PORTE_RE3_MASK                           equ 0008h
PORTE_RE4_POSN                           equ 0004h
PORTE_RE4_POSITION                       equ 0004h
PORTE_RE4_SIZE                           equ 0001h
PORTE_RE4_LENGTH                         equ 0001h
PORTE_RE4_MASK                           equ 0010h
PORTE_RE5_POSN                           equ 0005h
PORTE_RE5_POSITION                       equ 0005h
PORTE_RE5_SIZE                           equ 0001h
PORTE_RE5_LENGTH                         equ 0001h
PORTE_RE5_MASK                           equ 0020h
PORTE_RE6_POSN                           equ 0006h
PORTE_RE6_POSITION                       equ 0006h
PORTE_RE6_SIZE                           equ 0001h
PORTE_RE6_LENGTH                         equ 0001h
PORTE_RE6_MASK                           equ 0040h
PORTE_RE7_POSN                           equ 0007h
PORTE_RE7_POSITION                       equ 0007h
PORTE_RE7_SIZE                           equ 0001h
PORTE_RE7_LENGTH                         equ 0001h
PORTE_RE7_MASK                           equ 0080h

// Register: PIR1
#define PIR1 PIR1
PIR1                                     equ 0011h
// bitfield definitions
PIR1_TMR1IF_POSN                         equ 0000h
PIR1_TMR1IF_POSITION                     equ 0000h
PIR1_TMR1IF_SIZE                         equ 0001h
PIR1_TMR1IF_LENGTH                       equ 0001h
PIR1_TMR1IF_MASK                         equ 0001h
PIR1_TMR2IF_POSN                         equ 0001h
PIR1_TMR2IF_POSITION                     equ 0001h
PIR1_TMR2IF_SIZE                         equ 0001h
PIR1_TMR2IF_LENGTH                       equ 0001h
PIR1_TMR2IF_MASK                         equ 0002h
PIR1_CCP1IF_POSN                         equ 0002h
PIR1_CCP1IF_POSITION                     equ 0002h
PIR1_CCP1IF_SIZE                         equ 0001h
PIR1_CCP1IF_LENGTH                       equ 0001h
PIR1_CCP1IF_MASK                         equ 0004h
PIR1_SSP1IF_POSN                         equ 0003h
PIR1_SSP1IF_POSITION                     equ 0003h
PIR1_SSP1IF_SIZE                         equ 0001h
PIR1_SSP1IF_LENGTH                       equ 0001h
PIR1_SSP1IF_MASK                         equ 0008h
PIR1_TX1IF_POSN                          equ 0004h
PIR1_TX1IF_POSITION                      equ 0004h
PIR1_TX1IF_SIZE                          equ 0001h
PIR1_TX1IF_LENGTH                        equ 0001h
PIR1_TX1IF_MASK                          equ 0010h
PIR1_RC1IF_POSN                          equ 0005h
PIR1_RC1IF_POSITION                      equ 0005h
PIR1_RC1IF_SIZE                          equ 0001h
PIR1_RC1IF_LENGTH                        equ 0001h
PIR1_RC1IF_MASK                          equ 0020h
PIR1_ADIF_POSN                           equ 0006h
PIR1_ADIF_POSITION                       equ 0006h
PIR1_ADIF_SIZE                           equ 0001h
PIR1_ADIF_LENGTH                         equ 0001h
PIR1_ADIF_MASK                           equ 0040h
PIR1_TMR1GIF_POSN                        equ 0007h
PIR1_TMR1GIF_POSITION                    equ 0007h
PIR1_TMR1GIF_SIZE                        equ 0001h
PIR1_TMR1GIF_LENGTH                      equ 0001h
PIR1_TMR1GIF_MASK                        equ 0080h
PIR1_SSPIF_POSN                          equ 0003h
PIR1_SSPIF_POSITION                      equ 0003h
PIR1_SSPIF_SIZE                          equ 0001h
PIR1_SSPIF_LENGTH                        equ 0001h
PIR1_SSPIF_MASK                          equ 0008h
PIR1_TXIF_POSN                           equ 0004h
PIR1_TXIF_POSITION                       equ 0004h
PIR1_TXIF_SIZE                           equ 0001h
PIR1_TXIF_LENGTH                         equ 0001h
PIR1_TXIF_MASK                           equ 0010h
PIR1_RCIF_POSN                           equ 0005h
PIR1_RCIF_POSITION                       equ 0005h
PIR1_RCIF_SIZE                           equ 0001h
PIR1_RCIF_LENGTH                         equ 0001h
PIR1_RCIF_MASK                           equ 0020h

// Register: PIR2
#define PIR2 PIR2
PIR2                                     equ 0012h
// bitfield definitions
PIR2_CCP2IF_POSN                         equ 0000h
PIR2_CCP2IF_POSITION                     equ 0000h
PIR2_CCP2IF_SIZE                         equ 0001h
PIR2_CCP2IF_LENGTH                       equ 0001h
PIR2_CCP2IF_MASK                         equ 0001h
PIR2_TMR8IF_POSN                         equ 0001h
PIR2_TMR8IF_POSITION                     equ 0001h
PIR2_TMR8IF_SIZE                         equ 0001h
PIR2_TMR8IF_LENGTH                       equ 0001h
PIR2_TMR8IF_MASK                         equ 0002h
PIR2_TMR10IF_POSN                        equ 0002h
PIR2_TMR10IF_POSITION                    equ 0002h
PIR2_TMR10IF_SIZE                        equ 0001h
PIR2_TMR10IF_LENGTH                      equ 0001h
PIR2_TMR10IF_MASK                        equ 0004h
PIR2_BCL1IF_POSN                         equ 0003h
PIR2_BCL1IF_POSITION                     equ 0003h
PIR2_BCL1IF_SIZE                         equ 0001h
PIR2_BCL1IF_LENGTH                       equ 0001h
PIR2_BCL1IF_MASK                         equ 0008h
PIR2_TMR3GIF_POSN                        equ 0005h
PIR2_TMR3GIF_POSITION                    equ 0005h
PIR2_TMR3GIF_SIZE                        equ 0001h
PIR2_TMR3GIF_LENGTH                      equ 0001h
PIR2_TMR3GIF_MASK                        equ 0020h
PIR2_TMR5GIF_POSN                        equ 0006h
PIR2_TMR5GIF_POSITION                    equ 0006h
PIR2_TMR5GIF_SIZE                        equ 0001h
PIR2_TMR5GIF_LENGTH                      equ 0001h
PIR2_TMR5GIF_MASK                        equ 0040h
PIR2_OSFIF_POSN                          equ 0007h
PIR2_OSFIF_POSITION                      equ 0007h
PIR2_OSFIF_SIZE                          equ 0001h
PIR2_OSFIF_LENGTH                        equ 0001h
PIR2_OSFIF_MASK                          equ 0080h
PIR2_BCLIF_POSN                          equ 0003h
PIR2_BCLIF_POSITION                      equ 0003h
PIR2_BCLIF_SIZE                          equ 0001h
PIR2_BCLIF_LENGTH                        equ 0001h
PIR2_BCLIF_MASK                          equ 0008h

// Register: PIR3
#define PIR3 PIR3
PIR3                                     equ 0013h
// bitfield definitions
PIR3_TMR3IF_POSN                         equ 0000h
PIR3_TMR3IF_POSITION                     equ 0000h
PIR3_TMR3IF_SIZE                         equ 0001h
PIR3_TMR3IF_LENGTH                       equ 0001h
PIR3_TMR3IF_MASK                         equ 0001h
PIR3_TMR4IF_POSN                         equ 0001h
PIR3_TMR4IF_POSITION                     equ 0001h
PIR3_TMR4IF_SIZE                         equ 0001h
PIR3_TMR4IF_LENGTH                       equ 0001h
PIR3_TMR4IF_MASK                         equ 0002h
PIR3_TMR5IF_POSN                         equ 0002h
PIR3_TMR5IF_POSITION                     equ 0002h
PIR3_TMR5IF_SIZE                         equ 0001h
PIR3_TMR5IF_LENGTH                       equ 0001h
PIR3_TMR5IF_MASK                         equ 0004h
PIR3_TMR6IF_POSN                         equ 0003h
PIR3_TMR6IF_POSITION                     equ 0003h
PIR3_TMR6IF_SIZE                         equ 0001h
PIR3_TMR6IF_LENGTH                       equ 0001h
PIR3_TMR6IF_MASK                         equ 0008h
PIR3_CCP3IF_POSN                         equ 0004h
PIR3_CCP3IF_POSITION                     equ 0004h
PIR3_CCP3IF_SIZE                         equ 0001h
PIR3_CCP3IF_LENGTH                       equ 0001h
PIR3_CCP3IF_MASK                         equ 0010h
PIR3_CCP4IF_POSN                         equ 0005h
PIR3_CCP4IF_POSITION                     equ 0005h
PIR3_CCP4IF_SIZE                         equ 0001h
PIR3_CCP4IF_LENGTH                       equ 0001h
PIR3_CCP4IF_MASK                         equ 0020h
PIR3_CCP5IF_POSN                         equ 0006h
PIR3_CCP5IF_POSITION                     equ 0006h
PIR3_CCP5IF_SIZE                         equ 0001h
PIR3_CCP5IF_LENGTH                       equ 0001h
PIR3_CCP5IF_MASK                         equ 0040h
PIR3_CCP6IF_POSN                         equ 0007h
PIR3_CCP6IF_POSITION                     equ 0007h
PIR3_CCP6IF_SIZE                         equ 0001h
PIR3_CCP6IF_LENGTH                       equ 0001h
PIR3_CCP6IF_MASK                         equ 0080h

// Register: PIR4
#define PIR4 PIR4
PIR4                                     equ 0014h
// bitfield definitions
PIR4_SSP2IF_POSN                         equ 0000h
PIR4_SSP2IF_POSITION                     equ 0000h
PIR4_SSP2IF_SIZE                         equ 0001h
PIR4_SSP2IF_LENGTH                       equ 0001h
PIR4_SSP2IF_MASK                         equ 0001h
PIR4_BCL2IF_POSN                         equ 0001h
PIR4_BCL2IF_POSITION                     equ 0001h
PIR4_BCL2IF_SIZE                         equ 0001h
PIR4_BCL2IF_LENGTH                       equ 0001h
PIR4_BCL2IF_MASK                         equ 0002h
PIR4_CCP7IF_POSN                         equ 0002h
PIR4_CCP7IF_POSITION                     equ 0002h
PIR4_CCP7IF_SIZE                         equ 0001h
PIR4_CCP7IF_LENGTH                       equ 0001h
PIR4_CCP7IF_MASK                         equ 0004h
PIR4_CCP8IF_POSN                         equ 0003h
PIR4_CCP8IF_POSITION                     equ 0003h
PIR4_CCP8IF_SIZE                         equ 0001h
PIR4_CCP8IF_LENGTH                       equ 0001h
PIR4_CCP8IF_MASK                         equ 0008h
PIR4_TX2IF_POSN                          equ 0004h
PIR4_TX2IF_POSITION                      equ 0004h
PIR4_TX2IF_SIZE                          equ 0001h
PIR4_TX2IF_LENGTH                        equ 0001h
PIR4_TX2IF_MASK                          equ 0010h
PIR4_RC2IF_POSN                          equ 0005h
PIR4_RC2IF_POSITION                      equ 0005h
PIR4_RC2IF_SIZE                          equ 0001h
PIR4_RC2IF_LENGTH                        equ 0001h
PIR4_RC2IF_MASK                          equ 0020h
PIR4_CCP9IF_POSN                         equ 0006h
PIR4_CCP9IF_POSITION                     equ 0006h
PIR4_CCP9IF_SIZE                         equ 0001h
PIR4_CCP9IF_LENGTH                       equ 0001h
PIR4_CCP9IF_MASK                         equ 0040h
PIR4_CCP10IF_POSN                        equ 0007h
PIR4_CCP10IF_POSITION                    equ 0007h
PIR4_CCP10IF_SIZE                        equ 0001h
PIR4_CCP10IF_LENGTH                      equ 0001h
PIR4_CCP10IF_MASK                        equ 0080h

