GopalSaraf/Practicals/PSDL/include/proc/pic16f1526.inc
// Register: CCPR2H
#define CCPR2H CCPR2H
CCPR2H                                   equ 0299h
// bitfield definitions
CCPR2H_CCPR2H_POSN                       equ 0000h
CCPR2H_CCPR2H_POSITION                   equ 0000h
CCPR2H_CCPR2H_SIZE                       equ 0008h
CCPR2H_CCPR2H_LENGTH                     equ 0008h
CCPR2H_CCPR2H_MASK                       equ 00FFh

// Register: CCP2CON
#define CCP2CON CCP2CON
CCP2CON                                  equ 029Ah
// bitfield definitions
CCP2CON_CCP2M_POSN                       equ 0000h
CCP2CON_CCP2M_POSITION                   equ 0000h
CCP2CON_CCP2M_SIZE                       equ 0004h
CCP2CON_CCP2M_LENGTH                     equ 0004h
CCP2CON_CCP2M_MASK                       equ 000Fh
CCP2CON_DC2B_POSN                        equ 0004h
CCP2CON_DC2B_POSITION                    equ 0004h
CCP2CON_DC2B_SIZE                        equ 0002h
CCP2CON_DC2B_LENGTH                      equ 0002h
CCP2CON_DC2B_MASK                        equ 0030h
CCP2CON_CCP2M0_POSN                      equ 0000h
CCP2CON_CCP2M0_POSITION                  equ 0000h
CCP2CON_CCP2M0_SIZE                      equ 0001h
CCP2CON_CCP2M0_LENGTH                    equ 0001h
CCP2CON_CCP2M0_MASK                      equ 0001h
CCP2CON_CCP2M1_POSN                      equ 0001h
CCP2CON_CCP2M1_POSITION                  equ 0001h
CCP2CON_CCP2M1_SIZE                      equ 0001h
CCP2CON_CCP2M1_LENGTH                    equ 0001h
CCP2CON_CCP2M1_MASK                      equ 0002h
CCP2CON_CCP2M2_POSN                      equ 0002h
CCP2CON_CCP2M2_POSITION                  equ 0002h
CCP2CON_CCP2M2_SIZE                      equ 0001h
CCP2CON_CCP2M2_LENGTH                    equ 0001h
CCP2CON_CCP2M2_MASK                      equ 0004h
CCP2CON_CCP2M3_POSN                      equ 0003h
CCP2CON_CCP2M3_POSITION                  equ 0003h
CCP2CON_CCP2M3_SIZE                      equ 0001h
CCP2CON_CCP2M3_LENGTH                    equ 0001h
CCP2CON_CCP2M3_MASK                      equ 0008h
CCP2CON_DC2B0_POSN                       equ 0004h
CCP2CON_DC2B0_POSITION                   equ 0004h
CCP2CON_DC2B0_SIZE                       equ 0001h
CCP2CON_DC2B0_LENGTH                     equ 0001h
CCP2CON_DC2B0_MASK                       equ 0010h
CCP2CON_DC2B1_POSN                       equ 0005h
CCP2CON_DC2B1_POSITION                   equ 0005h
CCP2CON_DC2B1_SIZE                       equ 0001h
CCP2CON_DC2B1_LENGTH                     equ 0001h
CCP2CON_DC2B1_MASK                       equ 0020h

// Register: CCPTMRS0
#define CCPTMRS0 CCPTMRS0
CCPTMRS0                                 equ 029Dh
// bitfield definitions
CCPTMRS0_C1TSEL_POSN                     equ 0000h
CCPTMRS0_C1TSEL_POSITION                 equ 0000h
CCPTMRS0_C1TSEL_SIZE                     equ 0002h
CCPTMRS0_C1TSEL_LENGTH                   equ 0002h
CCPTMRS0_C1TSEL_MASK                     equ 0003h
CCPTMRS0_C2TSEL_POSN                     equ 0002h
CCPTMRS0_C2TSEL_POSITION                 equ 0002h
CCPTMRS0_C2TSEL_SIZE                     equ 0002h
CCPTMRS0_C2TSEL_LENGTH                   equ 0002h
CCPTMRS0_C2TSEL_MASK                     equ 000Ch
CCPTMRS0_C3TSEL_POSN                     equ 0004h
CCPTMRS0_C3TSEL_POSITION                 equ 0004h
CCPTMRS0_C3TSEL_SIZE                     equ 0002h
CCPTMRS0_C3TSEL_LENGTH                   equ 0002h
CCPTMRS0_C3TSEL_MASK                     equ 0030h
CCPTMRS0_C4TSEL_POSN                     equ 0006h
CCPTMRS0_C4TSEL_POSITION                 equ 0006h
CCPTMRS0_C4TSEL_SIZE                     equ 0002h
CCPTMRS0_C4TSEL_LENGTH                   equ 0002h
CCPTMRS0_C4TSEL_MASK                     equ 00C0h
CCPTMRS0_C1TSEL0_POSN                    equ 0000h
CCPTMRS0_C1TSEL0_POSITION                equ 0000h
CCPTMRS0_C1TSEL0_SIZE                    equ 0001h
CCPTMRS0_C1TSEL0_LENGTH                  equ 0001h
CCPTMRS0_C1TSEL0_MASK                    equ 0001h
CCPTMRS0_C1TSEL1_POSN                    equ 0001h
CCPTMRS0_C1TSEL1_POSITION                equ 0001h
CCPTMRS0_C1TSEL1_SIZE                    equ 0001h
CCPTMRS0_C1TSEL1_LENGTH                  equ 0001h
CCPTMRS0_C1TSEL1_MASK                    equ 0002h
CCPTMRS0_C2TSEL0_POSN                    equ 0002h
CCPTMRS0_C2TSEL0_POSITION                equ 0002h
CCPTMRS0_C2TSEL0_SIZE                    equ 0001h
CCPTMRS0_C2TSEL0_LENGTH                  equ 0001h
CCPTMRS0_C2TSEL0_MASK                    equ 0004h
CCPTMRS0_C2TSEL1_POSN                    equ 0003h
CCPTMRS0_C2TSEL1_POSITION                equ 0003h
CCPTMRS0_C2TSEL1_SIZE                    equ 0001h
CCPTMRS0_C2TSEL1_LENGTH                  equ 0001h
CCPTMRS0_C2TSEL1_MASK                    equ 0008h
CCPTMRS0_C3TSEL0_POSN                    equ 0004h
CCPTMRS0_C3TSEL0_POSITION                equ 0004h
CCPTMRS0_C3TSEL0_SIZE                    equ 0001h
CCPTMRS0_C3TSEL0_LENGTH                  equ 0001h
CCPTMRS0_C3TSEL0_MASK                    equ 0010h
CCPTMRS0_C3TSEL1_POSN                    equ 0005h
CCPTMRS0_C3TSEL1_POSITION                equ 0005h
CCPTMRS0_C3TSEL1_SIZE                    equ 0001h
CCPTMRS0_C3TSEL1_LENGTH                  equ 0001h
CCPTMRS0_C3TSEL1_MASK                    equ 0020h
CCPTMRS0_C4TSEL0_POSN                    equ 0006h
CCPTMRS0_C4TSEL0_POSITION                equ 0006h
CCPTMRS0_C4TSEL0_SIZE                    equ 0001h
CCPTMRS0_C4TSEL0_LENGTH                  equ 0001h
CCPTMRS0_C4TSEL0_MASK                    equ 0040h
CCPTMRS0_C4TSEL1_POSN                    equ 0007h
CCPTMRS0_C4TSEL1_POSITION                equ 0007h
CCPTMRS0_C4TSEL1_SIZE                    equ 0001h
CCPTMRS0_C4TSEL1_LENGTH                  equ 0001h
CCPTMRS0_C4TSEL1_MASK                    equ 0080h

// Register: CCPTMRS1
#define CCPTMRS1 CCPTMRS1
CCPTMRS1                                 equ 029Eh
// bitfield definitions
CCPTMRS1_C5TSEL_POSN                     equ 0000h
CCPTMRS1_C5TSEL_POSITION                 equ 0000h
CCPTMRS1_C5TSEL_SIZE                     equ 0002h
CCPTMRS1_C5TSEL_LENGTH                   equ 0002h
CCPTMRS1_C5TSEL_MASK                     equ 0003h
CCPTMRS1_C6TSEL_POSN                     equ 0002h
CCPTMRS1_C6TSEL_POSITION                 equ 0002h
CCPTMRS1_C6TSEL_SIZE                     equ 0002h
CCPTMRS1_C6TSEL_LENGTH                   equ 0002h
CCPTMRS1_C6TSEL_MASK                     equ 000Ch
CCPTMRS1_C7TSEL_POSN                     equ 0004h
CCPTMRS1_C7TSEL_POSITION                 equ 0004h
CCPTMRS1_C7TSEL_SIZE                     equ 0002h
CCPTMRS1_C7TSEL_LENGTH                   equ 0002h
CCPTMRS1_C7TSEL_MASK                     equ 0030h
CCPTMRS1_C8TSEL_POSN                     equ 0006h
CCPTMRS1_C8TSEL_POSITION                 equ 0006h
CCPTMRS1_C8TSEL_SIZE                     equ 0002h
CCPTMRS1_C8TSEL_LENGTH                   equ 0002h
CCPTMRS1_C8TSEL_MASK                     equ 00C0h
CCPTMRS1_C5TSEL0_POSN                    equ 0000h
CCPTMRS1_C5TSEL0_POSITION                equ 0000h
CCPTMRS1_C5TSEL0_SIZE                    equ 0001h
CCPTMRS1_C5TSEL0_LENGTH                  equ 0001h
CCPTMRS1_C5TSEL0_MASK                    equ 0001h
CCPTMRS1_C5TSEL1_POSN                    equ 0001h
CCPTMRS1_C5TSEL1_POSITION                equ 0001h
CCPTMRS1_C5TSEL1_SIZE                    equ 0001h
CCPTMRS1_C5TSEL1_LENGTH                  equ 0001h
CCPTMRS1_C5TSEL1_MASK                    equ 0002h
CCPTMRS1_C6TSEL0_POSN                    equ 0002h
CCPTMRS1_C6TSEL0_POSITION                equ 0002h
CCPTMRS1_C6TSEL0_SIZE                    equ 0001h
CCPTMRS1_C6TSEL0_LENGTH                  equ 0001h
CCPTMRS1_C6TSEL0_MASK                    equ 0004h
CCPTMRS1_C6TSEL1_POSN                    equ 0003h
CCPTMRS1_C6TSEL1_POSITION                equ 0003h
CCPTMRS1_C6TSEL1_SIZE                    equ 0001h
CCPTMRS1_C6TSEL1_LENGTH                  equ 0001h
CCPTMRS1_C6TSEL1_MASK                    equ 0008h
CCPTMRS1_C7TSEL0_POSN                    equ 0004h
CCPTMRS1_C7TSEL0_POSITION                equ 0004h
CCPTMRS1_C7TSEL0_SIZE                    equ 0001h
CCPTMRS1_C7TSEL0_LENGTH                  equ 0001h
CCPTMRS1_C7TSEL0_MASK                    equ 0010h
CCPTMRS1_C7TSEL1_POSN                    equ 0005h
CCPTMRS1_C7TSEL1_POSITION                equ 0005h
CCPTMRS1_C7TSEL1_SIZE                    equ 0001h
CCPTMRS1_C7TSEL1_LENGTH                  equ 0001h
CCPTMRS1_C7TSEL1_MASK                    equ 0020h
CCPTMRS1_C8TSEL0_POSN                    equ 0006h
CCPTMRS1_C8TSEL0_POSITION                equ 0006h
CCPTMRS1_C8TSEL0_SIZE                    equ 0001h
CCPTMRS1_C8TSEL0_LENGTH                  equ 0001h
CCPTMRS1_C8TSEL0_MASK                    equ 0040h
CCPTMRS1_C8TSEL1_POSN                    equ 0007h
CCPTMRS1_C8TSEL1_POSITION                equ 0007h
CCPTMRS1_C8TSEL1_SIZE                    equ 0001h
CCPTMRS1_C8TSEL1_LENGTH                  equ 0001h
CCPTMRS1_C8TSEL1_MASK                    equ 0080h

// Register: CCPTMRS2
#define CCPTMRS2 CCPTMRS2
CCPTMRS2                                 equ 029Fh
// bitfield definitions
CCPTMRS2_C9TSEL_POSN                     equ 0000h
CCPTMRS2_C9TSEL_POSITION                 equ 0000h
CCPTMRS2_C9TSEL_SIZE                     equ 0002h
CCPTMRS2_C9TSEL_LENGTH                   equ 0002h
CCPTMRS2_C9TSEL_MASK                     equ 0003h
CCPTMRS2_C10TSEL_POSN                    equ 0002h
CCPTMRS2_C10TSEL_POSITION                equ 0002h
CCPTMRS2_C10TSEL_SIZE                    equ 0002h
CCPTMRS2_C10TSEL_LENGTH                  equ 0002h
CCPTMRS2_C10TSEL_MASK                    equ 000Ch
CCPTMRS2_C9TSEL0_POSN                    equ 0000h
CCPTMRS2_C9TSEL0_POSITION                equ 0000h
CCPTMRS2_C9TSEL0_SIZE                    equ 0001h
CCPTMRS2_C9TSEL0_LENGTH                  equ 0001h
CCPTMRS2_C9TSEL0_MASK                    equ 0001h
CCPTMRS2_C9TSEL1_POSN                    equ 0001h
CCPTMRS2_C9TSEL1_POSITION                equ 0001h
CCPTMRS2_C9TSEL1_SIZE                    equ 0001h
CCPTMRS2_C9TSEL1_LENGTH                  equ 0001h
CCPTMRS2_C9TSEL1_MASK                    equ 0002h
CCPTMRS2_C10TSEL0_POSN                   equ 0002h
CCPTMRS2_C10TSEL0_POSITION               equ 0002h
CCPTMRS2_C10TSEL0_SIZE                   equ 0001h
CCPTMRS2_C10TSEL0_LENGTH                 equ 0001h
CCPTMRS2_C10TSEL0_MASK                   equ 0004h
CCPTMRS2_C10TSEL1_POSN                   equ 0003h
CCPTMRS2_C10TSEL1_POSITION               equ 0003h
CCPTMRS2_C10TSEL1_SIZE                   equ 0001h
CCPTMRS2_C10TSEL1_LENGTH                 equ 0001h
CCPTMRS2_C10TSEL1_MASK                   equ 0008h

